[
  {
    "title": "Murder on the Orient Express",
    "summary": "A snowbound luxury train hides a brutal stabbing.\nDetective Hercule Poirot interviews suspects one by one amid isolation.\nThemes of deception, justice versus legality, and collective guilt drive the mystery."
  },
  {
    "title": "The Catcher in the Rye",
    "summary": "Holden Caulfield roams wintery New York after expulsion.\nHe rails against phoniness while craving authenticity and childhood innocence.\nAlienation, identity crisis, rebellion and coming‑of‑age shape his cynical voice."
  },
  {
    "title": "Milk and Honey",
    "summary": "Four poetic sections—hurting, loving, breaking, healing—trace a woman's journey.\nMinimalist verse confronts trauma, abuse and patriarchy with raw honesty.\nThemes of love, feminism, empowerment and personal healing invite reflection."
  },
  {
    "title": "1984",
    "summary": "Winston Smith secretly rebels against Big Brother’s all‑seeing Party.\nHe clings to truth and love under relentless surveillance and propaganda.\nTotalitarianism, language control, fear and the fight for freedom dominate the dystopia."
  },
  {
    "title": "Brave New World",
    "summary": "In a test‑tube society kept docile by pleasure and the drug soma.\nOutsiders question whether engineered happiness is worth individuality and art.\nTechnology, social control, consumerism and the cost of freedom anchor the satire."
  },
  {
    "title": "Fahrenheit 451",
    "summary": "Fireman Guy Montag burns books until curiosity sparks a hidden hunger for ideas.\nEncounters with a free spirit and secret readers shatter his conformity.\nCensorship, intellectual freedom and media-driven apathy blaze through the narrative."
  },
  {
    "title": "The Hobbit",
    "summary": "Home‑loving Bilbo Baggins joins dwarves on a perilous quest to the Lonely Mountain.\nTrolls, elves, and a dragon test his courage as friendship deepens.\nAdventure, greed, loyalty and the hero’s journey illuminate this fantasy."
  },
  {
    "title": "To Kill a Mockingbird",
    "summary": "Scout Finch observes her father defend a Black man in 1930s Alabama.\nThe trial exposes racial injustice while childhood games teach empathy.\nThemes of moral growth, prejudice, compassion and innocence converge."
  },
  {
    "title": "Educated",
    "summary": "Tara Westover grows up off‑grid with survivalist parents who distrust schools.\nSelf‑study propels her from junkyard to Cambridge, straining family bonds.\nEducation, self‑discovery, loyalty and coming‑of‑age frame this memoir."
  },
  {
    "title": "Sapiens: A Brief History of Humankind",
    "summary": "Harari condenses 300,000 years of Homo sapiens into a sweeping narrative.\nHe argues shared myths like money and religion enable massive cooperation.\nHuman evolution, culture and cognition challenge readers to reconsider progress."
  },
  {
    "title": "Pride and Prejudice",
    "summary": "Quick‑witted Elizabeth Bennet spars with the aloof Mr. Darcy.\nMisjudgments unravel amid balls, gossip and family pressures in Regency England.\nSocial class, marriage, coming‑of‑age and self‑knowledge steer their romance."
  },
  {
    "title": "The Alchemist",
    "summary": "Shepherd Santiago dreams of treasure and crosses deserts seeking destiny.\nGuided by omens, he meets kings, alchemists and learns the soul of the world.\nPersonal legend, faith, perseverance and following one’s heart form the fable."
  },
  {
    "title": "The Fault in Our Stars",
    "summary": "Cancer patient Hazel meets survivor Augustus at a support group.\nTheir whirlwind romance confronts pain, joy, and the search for meaning.\nLove, mortality, illness and coming-of-age intertwine in this poignant young-adult tale."
  }
]
